# This project will analyze CIA World Factbook Data using python and SQLite #

In this project, we'll work with data from the CIA World Factbook, a compendium of statistics about all of the countries on Earth. The Factbook contains demographic information like:

- population - The population as of 2015.
- population_growth - The annual population growth rate, as a percentage.
- area - The total land and water area.

You can download the SQLite database, factbook.db, if you want to work with it on your own computer. In this guided project, we'll use SQL to explore and analyze data from this database.

We'll use the following code to connect our Jupyter Notebook to our database file:

In [1]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

### Overview of the Data ###
1. Write a query to return information on the tables in the database.
2. Write and run another query that returns the first 5 rows of the facts table in the database.

In [2]:
%%sql
select * from sqlite_master where type = 'table';

 * sqlite:///factbook.db
Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [3]:
%%sql
select* from facts limit 5;

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]


## Summary Statistics ##

### Column Descriptions ###

- name - The name of the country.
- area - The total land and sea area of the country.
- population - The country's population.
- population_growth- The country's population growth as a percentage.
- birth_rate - The country's birth rate, or the number of births a year per 1,000 people.
- death_rate - The country's death rate, or the number of death a year per 1,000 people.
- area- The country's total area (both land and water).
- area_land - The country's land area in square kilometers.
- area_water - The country's waterarea in square kilometers.

### Write a single Query to Return the: ###

- Minimum population
- Maximum population
- Minimum population growth
- Maximum population growth

In [4]:
%%sql
select min(population), max(population), min(population_growth),max(population_growth) from facts

 * sqlite:///factbook.db
Done.

[(0, 7256490011, 0.0, 4.02)]

## Exlporing Outliers ##

1. Write a query that returns the countrie(s) with the minimum population.
2. Write a query that returns the countrie(s) with the maximum population.

### Country with the minimum populations : ###

In [5]:
%%sql
select name from facts where population = (select min(population) from facts)

 * sqlite:///factbook.db
Done.

[('Antarctica',)]

### Country with the maximum population: ###

In [6]:
%%sql
select name from facts where population = (select max(population) from facts)

 * sqlite:///factbook.db
Done.

[('World',)]

## Exlpore Average Population and Area ##

### Calculate the average value for : ###

- population
- area

In [7]:
%%sql
select avg(population),avg(area) from facts

 * sqlite:///factbook.db
Done.

[(62094928.32231405, 555093.546184739)]

## Find countries that are denseley populated ##

Do this by finding countries thathave above average populations and below average area

In [8]:
%%sql
select name from facts where
population > (select avg(population) from facts)
and 
area < (select avg(area) from facts)
order by population desc

 * sqlite:///factbook.db
Done.

[('Bangladesh',),
 ('Japan',),
 ('Philippines',),
 ('Vietnam',),
 ('Germany',),
 ('Thailand',),
 ('United Kingdom',)]

### Which countries have the highest ratios of water to land ? ###

In [9]:
%%sql
select name , cast(area_water as float) / cast(area_land as float) as ratio_water_land from facts
order by ratio_water_land desc limit 20

 * sqlite:///factbook.db
Done.

[('British Indian Ocean Territory', 905.6666666666666),
 ('Virgin Islands', 4.520231213872832),
 ('Puerto Rico', 0.5547914317925592),
 ('Bahamas, The', 0.3866133866133866),
 ('Guinea-Bissau', 0.2846728307254623),
 ('Malawi', 0.25939625850340137),
 ('Netherlands', 0.22571032366565366),
 ('Uganda', 0.22292237442922375),
 ('Eritrea', 0.16435643564356436),
 ('Liberia', 0.15623961794019933),
 ('Bangladesh', 0.1405085657217485),
 ('Gambia, The', 0.116600790513834),
 ('Taiwan', 0.1153130812151271),
 ('Finland', 0.11299639583299047),
 ('India', 0.10563390940312317),
 ('Canada', 0.09799992456155804),
 ('Sweden', 0.09738384490720996),
 ('Colombia', 0.09647636468662751),
 ('Brunei', 0.0949667616334283),
 ('Guyana', 0.09205025171578214)]

### Which Countries will add the most people to their population next year ? ###

In [10]:
%%sql
select * from facts where population_growth >
(select avg(population_growth) from facts)
order by population_growth desc
limit 10

 * sqlite:///factbook.db
Done.

[(162, 'od', 'South Sudan', 644329, None, None, 12042910, 4.02, 36.91, 8.18, 11.47),
 (106, 'mi', 'Malawi', 118484, 94080, 24404, 17964697, 3.32, 41.56, 8.41, 0.0),
 (29, 'by', 'Burundi', 27830, 25680, 2150, 10742276, 3.28, 42.01, 9.27, 0.0),
 (128, 'ng', 'Niger', None, 1266700, 300, 18045729, 3.25, 45.45, 12.42, 0.56),
 (182, 'ug', 'Uganda', 241038, 197100, 43938, 37101745, 3.24, 43.79, 10.69, 0.74),
 (141, 'qa', 'Qatar', 11586, 11586, 0, 2194817, 3.07, 9.84, 1.53, 22.39),
 (27, 'uv', 'Burkina Faso', 274200, 273800, 400, 18931686, 3.03, 42.03, 11.72, 0.0),
 (109, 'ml', 'Mali', 1240192, 1220190, 20002, 16955536, 2.98, 44.99, 12.89, 2.26),
 (219, 'cw', 'Cook Islands', 236, 236, 0, 9838, 2.95, 14.33, 8.03, None),
 (80, 'iz', 'Iraq', 438317, 437367, 950, 37056169, 2.93, 31.45, 3.77, 1.62)]

### Which countries have a higher death rate than birth rate ? ###

In [11]:
%%sql
select name, death_rate - birth_rate as deaths_minus_births
from facts where deaths_minus_births >0
order by deaths_minus_births desc limit 20

 * sqlite:///factbook.db
Done.

[('Bulgaria', 5.52),
 ('Serbia', 4.58),
 ('Latvia', 4.3100000000000005),
 ('Lithuania', 4.17),
 ('Ukraine', 3.74),
 ('Hungary', 3.5700000000000003),
 ('Germany', 2.9499999999999993),
 ('Slovenia', 2.9499999999999993),
 ('Romania', 2.76),
 ('Croatia', 2.7300000000000004),
 ('Belarus', 2.66),
 ('Monaco', 2.59),
 ('Greece', 2.4299999999999997),
 ('Saint Pierre and Miquelon', 2.3000000000000007),
 ('Russia', 2.09),
 ('Estonia', 1.8900000000000006),
 ('Portugal', 1.75),
 ('Japan', 1.58),
 ('Italy', 1.4499999999999993),
 ('Bosnia and Herzegovina', 0.8800000000000008)]

In [12]:
%%sql

select * from facts limit 3;

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92)]